Revit 2027 API
CoordinationModelLinkUtils.ContainsCategory Method
 Checks whether a provided string is a element category name in the provided AutodeskDocs Coordination Model type.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ContainsCategory(
	Document document,
	ElementType coordinationModelType,
	string categoryName
)
Public Shared Function ContainsCategory (
	document As Document,
	coordinationModelType As ElementType,
	categoryName As String
) As Boolean
public:
static bool ContainsCategory(
	Document^ document,
	ElementType^ coordinationModelType,
	String^ categoryName
)
static member ContainsCategory :
        document : Document *
        coordinationModelType : ElementType *
        categoryName : string -> bool
Parameters
document Document
 The document.
coordinationModelType ElementType
 The Coordination Model type element.
categoryName String
 The element category name to check.
Return Value
Boolean
 True if the categoryName is a element category name in the provided AutodeskDocs Coordination Model type; false otherwise.
Exceptions
Exception | Condition
ArgumentException |  categoryName is an empty string. -or- The provided element is not a Autodesk Docs Coordination Model type.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace